// • A) пустой массив;
const a =[];

// • B) массив с тремя числовыми элементами;
const b =[1,2,3];

// • C) массив с тремя строковыми элементами;
const c =['1','2','3'];

// • D) массив с тремя строковыми и с тремя числовыми элементами;
const d =[1,2,3,'1','2','3'];

// • E) массив с именами всех твоих одногруппников;
const e =['Adam', 'Ali', 'Turpal', 'Muhammad', 'Magomed'];

//• F) массив, в котором есть число, строка, null, undefined, true и false;
const f =[1,'1', null, undefined, true, false];

// • G) массив, внутри которого три пустых массива;
const g =[[],[],[]];

//• H) массив, внутри которого два массива, а внутри каждого вложенного массива любые три числа.
const h =[[1,2,3],[4,5,6]];